snlkuharlocal/src/Documents/СписаниеСЗХ/СписаниеСЗХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСЗХ</name>
  <registerRecords>AccumulationRegister.АдресноеХранениеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиЗХ</registerRecords>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>CatalogRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Паллета</name>
    <type>
      <types>DocumentRef.Паллета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Короба</name>
    <attributes>
      <name>ШККоробки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>17</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерНакладной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКЛистаНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШКПаллеты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКоробки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>КоробовВНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоробокВНакладной</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиЗХ/ОстаткиЗХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиЗХ</name>
  <resources>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерЛистаНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКЛистаНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗонаХранения</name>
    <type>
      <types>CatalogRef.ЗоныХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШККоробки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ШКПаллеты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/АдресноеХранениеОстатки/АдресноеХранениеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АдресноеХранениеОстатки</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗонаХранения</name>
    <type>
      <types>CatalogRef.ЗоныХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/СписаниеСЗХ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	СписокШК=Короба.ВыгрузитьКолонку("ШККоробки");
	
	Запрос=новый запрос;  	
	Запрос.Текст="ВЫБРАТЬ
	|	ОстаткиЗХОстатки.ШККоробки как ШККоробки 
	|ИЗ
	|	РегистрНакопления.ОстаткиЗХ.Остатки(
	|			&Дата,
	|			ШККоробки В (&Шк)
	|				И ЗонаХранения = &ЗХ) КАК ОстаткиЗХОстатки
	|ГДЕ
	|	ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0";				 
	Запрос.УстановитьПараметр("ШК",СписокШК);
	Запрос.УстановитьПараметр("Дата",Дата);
	запрос.УстановитьПараметр("ЗХ",ЗонаХранения);	
	ЕстьНаОстаткахТекЗХ=запрос.Выполнить().выгрузить().ВыгрузитьКолонку("ШККоробки");
	
	
	
	Запрос=новый запрос; 
	Запрос.Текст="ВЫБРАТЬ
	             |	ОстаткиЗХОстатки.ШККоробки КАК ШККоробки,
	             |	ОстаткиЗХОстатки.ЗонаХранения КАК ЗонаХранения,
	             |	ОстаткиЗХОстатки.ШКПаллеты
	             |ИЗ
	             |	РегистрНакопления.ОстаткиЗХ.Остатки(
	             |			&Дата,
	             |			ШККоробки В (&Шк)
	             |				И (НЕ ШККоробки В (&ШкЕстьНаОстатках))) КАК ОстаткиЗХОстатки
	             |ГДЕ
	             |	ОстаткиЗХОстатки.КоличествоКоробокОстаток > 0";				 
	Запрос.УстановитьПараметр("ШК",СписокШК);
	Запрос.УстановитьПараметр("ШкЕстьНаОстатках",ЕстьНаОстаткахТекЗХ);	
	Запрос.УстановитьПараметр("Дата",Дата);
	ЕстьНаОстаткахГдеТоЕще=запрос.Выполнить().Выгрузить();
	
	
	
	Для Каждого ТекСтрокаКороба Из Короба Цикл
		ЕстьВтекущемЗх=ЕстьНаОстаткахТекЗХ.Найти(ТекСтрокаКороба.ШККоробки);
		если ЕстьВтекущемЗх<>Неопределено тогда
			Движение = Движения.ОстаткиЗХ.Добавить();
			ЗаполнитьЗначенияСвойств(движение,ТекСтрокаКороба);
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ЗонаХранения = ЗонаХранения;
			Движение.КоличествоКоробок = 1;
		иначе
			ЕстьВДругихЗХ=ЕстьНаОстаткахГдеТоЕще.Найти(ТекСтрокаКороба.ШККоробки);
			если ЕстьВДругихЗХ<>Неопределено тогда
				Движение = Движения.ОстаткиЗХ.Добавить();
				ЗаполнитьЗначенияСвойств(движение,ТекСтрокаКороба);
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.ЗонаХранения = ЕстьВДругихЗХ.ЗонаХранения;
				Движение.КоличествоКоробок = 1;
				#если клиент тогда
					Сообщить("Коробки с ШК "+ТекСтрокаКороба.ШККоробки+ " нет на остатках текущей зоны хранения. Коробка списана с зоны хранения - "+ЕстьВДругихЗХ.ЗонаХранения.наименование);
				#КонецЕсли

			иначе
				#если клиент тогда
					Сообщить("Коробки с ШК "+ТекСтрокаКороба.ШККоробки+ " нет на остатках ни в одной зоне хранения. Коробка не списана!");
				#КонецЕсли
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
	
	

	
	//Кухарь 26.09.17 начало
	//Проводки по остаткам адресного хранения номенклатуры
	для каждого СтрТЧ из Товары цикл
		если СтрТЧ.Количество=0 тогда Продолжить;КонецЕсли;	
		Движение = Движения.АдресноеХранениеОстатки.Добавить();
		ЗаполнитьЗначенияСвойств(движение,СтрТЧ);	
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		//Движение.Паллета=Паллета;
		Движение.ЗонаХранения = ЗонаХранения;
		Движение.КодОперации=Перечисления.КодыОперацийОстатки.Перемещение;		
	КонецЦикла;
	//Кухарь 26.09.17 конец	

	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		если не ЗначениеЗаполнено(ЗонаХранения) тогда
		#Если клиент тогда
			Сообщить("Заполните зону хранения");
		#КонецЕсли
		отказ=Истина;
	КонецЕсли;
	

КонецПроцедуры
